YUNSUNGWOONG/rtu_S32K312_R44-24.07.1_R240724_ARMGCC/Static_Code/Modules/b_mcal_nxp_S32K3xx/b_mcal_Base_nxp_S32K3xx/header/S32M27x_FLASH.h
/*
** ###################################################################
**     Processor:           S32M27x
**     Compiler:            Keil ARM C/C++ Compiler
**     Reference manual:    S32M27x RM Rev.1
**     Version:             rev. 1.1, 2023-01-03
**     Build:               b230103
**
**     Abstract:
**         Peripheral Access Layer for S32M27x
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2023 NXP
**
**     NXP Confidential. This software is owned or controlled by NXP and may
**     only be used strictly in accordance with the applicable license terms.
**     By expressly accepting such terms or by downloading, installing,
**     activating and/or otherwise using the software, you are agreeing that
**     you have read, and that you agree to comply with and are bound by,
**     such license terms. If you do not agree to be bound by the applicable
**     license terms, then you may not retain, install, activate or otherwise
**     use the software.
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
** ###################################################################
*/

/*!
 * @file S32M27x_FLASH.h
 * @version 1.1
 * @date 2023-01-03
 * @brief Peripheral Access Layer for S32M27x_FLASH
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32M27x_FLASH_H_)  /* Check if memory map has not been already included */
#define S32M27x_FLASH_H_

#include "S32M27x_COMMON.h"

/* ----------------------------------------------------------------------------
   -- FLASH Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup FLASH_Peripheral_Access_Layer FLASH Peripheral Access Layer
 * @{
 */

/** FLASH - Size of Registers Arrays */
#define FLASH_UM_COUNT                            9u
#define FLASH_DATA_COUNT                          32u

/** FLASH - Register Layout Typedef */
typedef struct {
  __IO uint32_t MCR;                               /**< Module Configuration, offset: 0x0 */
  __IO uint32_t MCRS;                              /**< Module Configuration Status, offset: 0x4 */
  __I  uint32_t MCRE;                              /**< Extended Module Configuration, offset: 0x8 */
  __IO uint32_t CTL;                               /**< Module Control, offset: 0xC */
  __IO uint32_t ADR;                               /**< Address, offset: 0x10 */
  __I  uint32_t PEADR;                             /**< Program and Erase Address, offset: 0x14 */
  uint8_t RESERVED_0[56];
  __I  uint32_t SPELOCK;                           /**< Sector Program and Erase Hardware Lock, offset: 0x50 */
  __I  uint32_t SSPELOCK;                          /**< Super Sector Program and Erase Hardware Lock, offset: 0x54 */
  uint8_t RESERVED_1[24];
  __I  uint32_t XSPELOCK;                          /**< Express Sector Program and Erase Hardware Lock, offset: 0x70 */
  __I  uint32_t XSSPELOCK;                         /**< Express Super Sector Program and Erase Hardware Lock, offset: 0x74 */
  uint8_t RESERVED_2[24];
  __IO uint32_t TMD;                               /**< Test Mode Disable Password Check, offset: 0x90 */
  __IO uint32_t UT0;                               /**< UTest 0, offset: 0x94 */
  __IO uint32_t UM[FLASH_UM_COUNT];                /**< UMISRn, array offset: 0x98, array step: 0x4 */
  __IO uint32_t UM9;                               /**< UMISR9, offset: 0xBC */
  uint8_t RESERVED_3[16];
  __IO uint32_t UD0;                               /**< UTest Data 0, offset: 0xD0 */
  __IO uint32_t UD1;                               /**< UTest Data 1, offset: 0xD4 */
  __IO uint32_t UD2;                               /**< UTest Data 2, offset: 0xD8 */
  __IO uint32_t UD3;                               /**< UTest Data 3, offset: 0xDC */
  __IO uint32_t UD4;                               /**< UTest Data 4, offset: 0xE0 */
  __IO uint32_t UD5;                               /**< UTest Data 5, offset: 0xE4 */
  __IO uint32_t UA0;                               /**< UTest Address 0, offset: 0xE8 */
  __IO uint32_t UA1;                               /**< UTest Address 1, offset: 0xEC */
  __IO uint32_t XMCR;                              /**< Express Module Configuration, offset: 0xF0 */
  __I  uint32_t XPEADR;                            /**< Express Program Address, offset: 0xF4 */
  uint8_t RESERVED_4[8];
  __IO uint32_t DATA[FLASH_DATA_COUNT];            /**< Program Data, array offset: 0x100, array step: 0x4 */
} FLASH_Type, *FLASH_MemMapPtr;

/** Number of instances of the FLASH module. */
#define FLASH_INSTANCE_COUNT                     (1u)

/* FLASH - Peripheral instance base addresses */
/** Peripheral FLASH base address */
#define IP_FLASH_BASE                            (0x402EC000u)
/** Peripheral FLASH base pointer */
#define IP_FLASH                                 ((FLASH_Type *)IP_FLASH_BASE)
/** Array initializer of FLASH peripheral base addresses */
#define IP_FLASH_BASE_ADDRS                      { IP_FLASH_BASE }
/** Array initializer of FLASH peripheral base pointers */
#define IP_FLASH_BASE_PTRS                       { IP_FLASH }

/* ----------------------------------------------------------------------------
   -- FLASH Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup FLASH_Register_Masks FLASH Register Masks
 * @{
 */

/*! @name MCR - Module Configuration */
/*! @{ */

#define FLASH_MCR_EHV_MASK                       (0x1U)
#define FLASH_MCR_EHV_SHIFT                      (0U)
#define FLASH_MCR_EHV_WIDTH                      (1U)
#define FLASH_MCR_EHV(x)                         (((uint32_t)(((uint32_t)(x)) << FLASH_MCR_EHV_SHIFT)) & FLASH_MCR_EHV_MASK)

#define FLASH_MCR_ERS_MASK                       (0x10U)
#define FLASH_MCR_ERS_SHIFT                      (4U)
#define FLASH_MCR_ERS_WIDTH                      (1U)
#define FLASH_MCR_ERS(x)                         (((uint32_t)(((uint32_t)(x)) << FLASH_MCR_ERS_SHIFT)) & FLASH_MCR_ERS_MASK)

#define FLASH_MCR_ESS_MASK                       (0x20U)
#define FLASH_MCR_ESS_SHIFT                      (5U)
#define FLASH_MCR_ESS_WIDTH                      (1U)
#define FLASH_MCR_ESS(x)                         (((uint32_t)(((uint32_t)(x)) << FLASH_MCR_ESS_SHIFT)) & FLASH_MCR_ESS_MASK)

#define FLASH_MCR_PGM_MASK                       (0x100U)
#define FLASH_MCR_PGM_SHIFT                      (8U)
#define FLASH_MCR_PGM_WIDTH                      (1U)
#define FLASH_MCR_PGM(x)                         (((uint32_t)(((uint32_t)(x)) << FLASH_MCR_PGM_SHIFT)) & FLASH_MCR_PGM_MASK)

